romopjorge/M2P/lib/esp32-sh1106-oled/Adafruit_SH1106.cpp
// startscrollright
// Activate a right handed scroll for rows start through stop
// Hint, the display is 16 rows tall. To scroll the whole display, run:
// display.scrollright(0x00, 0x0F) 
void Adafruit_SH1106::startscrollright(uint8_t start, uint8_t stop){
  sh1106_command(SH1106_RIGHT_HORIZONTAL_SCROLL);
  sh1106_command(0X00);
  sh1106_command(start);
  sh1106_command(0X00);
  sh1106_command(stop);
  sh1106_command(0X00);
  sh1106_command(0XFF);
  sh1106_command(SH1106_ACTIVATE_SCROLL);
}

// startscrollleft
// Activate a right handed scroll for rows start through stop
// Hint, the display is 16 rows tall. To scroll the whole display, run:
// display.scrollright(0x00, 0x0F) 
void Adafruit_SH1106::startscrollleft(uint8_t start, uint8_t stop){
  sh1106_command(SH1106_LEFT_HORIZONTAL_SCROLL);
  sh1106_command(0X00);
  sh1106_command(start);
  sh1106_command(0X00);
  sh1106_command(stop);
  sh1106_command(0X00);
  sh1106_command(0XFF);
  sh1106_command(SH1106_ACTIVATE_SCROLL);
}

// startscrolldiagright
// Activate a diagonal scroll for rows start through stop
// Hint, the display is 16 rows tall. To scroll the whole display, run:
// display.scrollright(0x00, 0x0F) 
void Adafruit_SH1106::startscrolldiagright(uint8_t start, uint8_t stop){
  sh1106_command(SH1106_SET_VERTICAL_SCROLL_AREA);  
  sh1106_command(0X00);
  sh1106_command(SH1106_LCDHEIGHT);
  sh1106_command(SH1106_VERTICAL_AND_RIGHT_HORIZONTAL_SCROLL);
  sh1106_command(0X00);
  sh1106_command(start);
  sh1106_command(0X00);
  sh1106_command(stop);
  sh1106_command(0X01);
  sh1106_command(SH1106_ACTIVATE_SCROLL);
}

// startscrolldiagleft
// Activate a diagonal scroll for rows start through stop
// Hint, the display is 16 rows tall. To scroll the whole display, run:
// display.scrollright(0x00, 0x0F) 
void Adafruit_SH1106::startscrolldiagleft(uint8_t start, uint8_t stop){
  sh1106_command(SH1106_SET_VERTICAL_SCROLL_AREA);  
  sh1106_command(0X00);
  sh1106_command(SH1106_LCDHEIGHT);
  sh1106_command(SH1106_VERTICAL_AND_LEFT_HORIZONTAL_SCROLL);
  sh1106_command(0X00);
  sh1106_command(start);
  sh1106_command(0X00);
  sh1106_command(stop);
  sh1106_command(0X01);
  sh1106_command(SH1106_ACTIVATE_SCROLL);
}

void Adafruit_SH1106::stopscroll(void){
  sh1106_command(SH1106_DEACTIVATE_SCROLL);
}

// Dim the display
// dim = true: display is dimmed
// dim = false: display is normal
void Adafruit_SH1106::dim(boolean dim) {
  uint8_t contrast;

  if (dim) {
    contrast = 0; // Dimmed display
  } else {
    if (_vccstate == SH1106_EXTERNALVCC) {
      contrast = 0x9F;
    } else {
      contrast = 0xCF;
    }
  }
  // the range of contrast to too small to be really useful
  // it is useful to dim the display
  sh1106_command(SH1106_SETCONTRAST);
  sh1106_command(contrast);
}

void Adafruit_SH1106::sh1106_data(uint8_t c) {
  if (sid != -1)
  {
    // SPI
    //digitalWrite(cs, HIGH);
    *csport |= cspinmask;
    //digitalWrite(dc, HIGH);
    *dcport |= dcpinmask;
    //digitalWrite(cs, LOW);
    *csport &= ~cspinmask;
    fastSPIwrite(c);
    //digitalWrite(cs, HIGH);
    *csport |= cspinmask;
  }
  else
  {
    // I2C
    uint8_t control = 0x40;   // Co = 0, D/C = 1
    Wire.beginTransmission(_i2caddr);
    WIRE_WRITE(control);
    WIRE_WRITE(c);
    Wire.endTransmission();
  }
}

void Adafruit_SH1106::display(void) {
  if (sid != -1)
  {

  	for (int8_t i = (SH1106_LCDHEIGHT/8)-1; i >= 0; i--)
  	{
      sh1106_command(0xB0 + i);		// Set row
      sh1106_command(SH1106_SETLOWCOLUMN);		// Set lower column address
      sh1106_command(SH1106_SETHIGHCOLUMN); // Set higher column address
      
      // SPI
      *csport |= cspinmask;
      *dcport |= dcpinmask;
      *csport &= ~cspinmask;
    
      for (uint16_t j = SH1106_LCDWIDTH; j > 0; j--)
      {
  		  fastSPIwrite(buffer[i*SH1106_LCDWIDTH+SH1106_LCDWIDTH-j]);
      }
      
      *csport |= cspinmask;
  	}
  }
  else
  {
    // save I2C bitrate
#ifndef ESP32
#ifndef __SAM3X8E__
    uint8_t twbrbackup = TWBR;
    TWBR = 12; // upgrade to 400KHz!
#endif
#endif
    //Serial.println(TWBR, DEC);
    //Serial.println(TWSR & 0x3, DEC);

    // I2C
  	for (int8_t i = (SH1106_LCDHEIGHT/8)-1; i >= 0; i--)
  	{
      sh1106_command(0xB0 + i);		// Set row
      sh1106_command(SH1106_SETLOWCOLUMN);		// Set lower column address
      sh1106_command(SH1106_SETHIGHCOLUMN); // Set higher column address
      
      for (uint16_t j = SH1106_LCDWIDTH; j > 0; j--)
      {
        // send a bunch of data in one xmission
        Wire.beginTransmission(_i2caddr);
        WIRE_WRITE(0x40);
        for (uint8_t x=0; x<16; x++) {
          WIRE_WRITE(buffer[i*SH1106_LCDWIDTH+SH1106_LCDWIDTH-j]);
          j--;
        }
        j++;
        Wire.endTransmission();
      }
    }
#ifndef ESP32
#ifndef __SAM3X8E__
    TWBR = twbrbackup;
#endif
#endif
  }
}

// clear everything
void Adafruit_SH1106::clearDisplay(void) {
  memset(buffer, 0, (SH1106_LCDWIDTH*SH1106_LCDHEIGHT/8));
}


inline void Adafruit_SH1106::fastSPIwrite(uint8_t d) {
  
  if(hwSPI) {
    (void)SPI.transfer(d);
  } else {
    for(uint8_t bit = 0x80; bit; bit >>= 1) {
      *clkport &= ~clkpinmask;
      if(d & bit) *mosiport |=  mosipinmask;
      else        *mosiport &= ~mosipinmask;
      *clkport |=  clkpinmask;
    }
  }
  //*csport |= cspinmask;
}

void Adafruit_SH1106::drawFastHLine(int16_t x, int16_t y, int16_t w, uint16_t color) {
  boolean bSwap = false;
  switch(rotation) { 
    case 0:
      // 0 degree rotation, do nothing
      break;
    case 1:
      // 90 degree rotation, swap x & y for rotation, then invert x
      bSwap = true;
      swap(x, y);
      x = WIDTH - x - 1;
      break;
    case 2:
      // 180 degree rotation, invert x and y - then shift y around for height.
      x = WIDTH - x - 1;
      y = HEIGHT - y - 1;
      x -= (w-1);
      break;
    case 3:
      // 270 degree rotation, swap x & y for rotation, then invert y  and adjust y for w (not to become h)
      bSwap = true;
      swap(x, y);
      y = HEIGHT - y - 1;
      y -= (w-1);
      break;
  }

